# Intro python data science
## Pr치ctica 08: importar datos csv a python

Vamos a ver c칩mo importar csv cuando:
* Punto 1: datos separados por coma
* Punto 2: datos separados por puntos y comas
* Punto 3: no hay nombres de columnas

# Punto 0:

In [1]:
# importar pandas
import pandas as pd

# Punto 1:

In [44]:
# caso 1: datos separados por coma

In [6]:
pd.read_csv('datos_rrss_t1.csv')

      Nombre  Cantidad     ES_FBK  Anio
0   Facebook      2449  VERDADERO  2006
1    Twitter       339      FALSO  2006
2  Instagram      1000  VERDADERO  2010
3    YouTube      2000      FALSO  2005
4   LinkedIn       663      FALSO  2003
5   WhatsApp      1600  VERDADERO  2009

# Punto 2:

In [ ]:
# caso 2: datos separados por puntos y comas

In [8]:
pd.read_csv('datos_rrss_t2.csv',
           sep=';')

      Nombre  Cantidad     ES_FBK  Anio
0   Facebook      2449  VERDADERO  2006
1    Twitter       339      FALSO  2006
2  Instagram      1000  VERDADERO  2010

# Punto 3:

In [ ]:
# caso 3: no hay nombres de columnas

In [11]:
pd.read_csv('datos_rrss_t3.csv')

    Facebook  2449  VERDADERO  2006
0    Twitter   339      FALSO  2006
1  Instagram  1000  VERDADERO  2010
2    YouTube  2000      FALSO  2005
3   LinkedIn   663      FALSO  2003
4   WhatsApp  1600  VERDADERO  2009

In [12]:
pd.read_csv('datos_rrss_t3.csv',
            header=None, 
            names=['Nombre', 'Cantidad', 'ES_FBK', 'Anio'])

                          Nombre  Cantidad  ES_FBK  Anio
0    Nombre;Cantidad;ES_FBK;Anio       NaN     NaN   NaN
1   Facebook;2449;VERDADERO;2006       NaN     NaN   NaN
2         Twitter;339;FALSO;2006       NaN     NaN   NaN
3  Instagram;1000;VERDADERO;2010       NaN     NaN   NaN

# Gracias!
## Espero que te lleves algo 칰til de este notebook 游

Para m치s videos de programaci칩n para ciencia de datos

https://www.youtube.com/c/RafaGonzalezGouveia/

Si quieres realizar alguno de los cursos online de pago, ve a:

https://cursos.gonzalezgouveia.com